package com.sx.log.enums;

/**
 * 地区代码
 *
 * @author xiashoucong
 * @version 版 本 号：1.0.0
 * @since 2023/4/27 9:09
 */
public enum AreaEnum {
    浙江省("330000","浙江省"),
    杭州市("330100","杭州市"),
    上城区("330102","上城区"),
    拱墅区("330105","拱墅区"),
    西湖区("330106","西湖区"),
    滨江区("330108","滨江区"),
    萧山区("330109","萧山区"),
    余杭区("330110","余杭区"),
    富阳区("330111","富阳区"),
    临安区("330112","临安区"),
    临平区("330113","临平区"),
    钱塘区("330114","钱塘区"),
    桐庐县("330122","桐庐县"),
    淳安县("330127","淳安县"),
    建德市("330182","建德市"),
    宁波市("330200","宁波市"),
    海曙区("330203","海曙区"),
    江北区("330205","江北区"),
    北仑区("330206","北仑区"),
    镇海区("330211","镇海区"),
    鄞州区("330212","鄞州区"),
    奉化区("330213","奉化区"),
    象山县("330225","象山县"),
    宁海县("330226","宁海县"),
    余姚市("330281","余姚市"),
    慈溪市("330282","慈溪市"),
    温州市("330300","温州市"),
    鹿城区("330302","鹿城区"),
    龙湾区("330303","龙湾区"),
    瓯海区("330304","瓯海区"),
    洞头区("330305","洞头区"),
    永嘉县("330324","永嘉县"),
    平阳县("330326","平阳县"),
    苍南县("330327","苍南县"),
    文成县("330328","文成县"),
    泰顺县("330329","泰顺县"),
    瑞安市("330381","瑞安市"),
    乐清市("330382","乐清市"),
    龙港市("330383","龙港市"),
    嘉兴市("330400","嘉兴市"),
    南湖区("330402","南湖区"),
    秀洲区("330411","秀洲区"),
    嘉善县("330421","嘉善县"),
    海盐县("330424","海盐县"),
    海宁市("330481","海宁市"),
    平湖市("330482","平湖市"),
    桐乡市("330483","桐乡市"),
    湖州市("330500","湖州市"),
    吴兴区("330502","吴兴区"),
    南浔区("330503","南浔区"),
    德清县("330521","德清县"),
    长兴县("330522","长兴县"),
    安吉县("330523","安吉县"),
    绍兴市("330600","绍兴市"),
    越城区("330602","越城区"),
    柯桥区("330603","柯桥区"),
    上虞区("330604","上虞区"),
    新昌县("330624","新昌县"),
    诸暨市("330681","诸暨市"),
    嵊州市("330683","嵊州市"),
    金华市("330700","金华市"),
    婺城区("330702","婺城区"),
    金东区("330703","金东区"),
    武义县("330723","武义县"),
    浦江县("330726","浦江县"),
    磐安县("330727","磐安县"),
    兰溪市("330781","兰溪市"),
    义乌市("330782","义乌市"),
    东阳市("330783","东阳市"),
    永康市("330784","永康市"),
    衢州市("330800","衢州市"),
    柯城区("330802","柯城区"),
    衢江区("330803","衢江区"),
    常山县("330822","常山县"),
    开化县("330824","开化县"),
    龙游县("330825","龙游县"),
    江山市("330881","江山市"),
    舟山市("330900","舟山市"),
    定海区("330902","定海区"),
    普陀区("330903","普陀区"),
    岱山县("330921","岱山县"),
    嵊泗县("330922","嵊泗县"),
    台州市("331000","台州市"),
    椒江区("331002","椒江区"),
    黄岩区("331003","黄岩区"),
    路桥区("331004","路桥区"),
    三门县("331022","三门县"),
    天台县("331023","天台县"),
    仙居县("331024","仙居县"),
    温岭市("331081","温岭市"),
    临海市("331082","临海市"),
    玉环市("331083","玉环市"),
    丽水市("331100","丽水市"),
    莲都区("331102","莲都区"),
    青田县("331121","青田县"),
    缙云县("331122","缙云县"),
    遂昌县("331123","遂昌县"),
    松阳县("331124","松阳县"),
    云和县("331125","云和县"),
    庆元县("331126","庆元县"),
    景宁畲族自治县("331127","景宁畲族自治县"),
    龙泉市("331181","龙泉市"),
    ;

    /**
     * 值
     */
    private String value;

    /**
     * 名称
     */
    private String name;

    AreaEnum(String value, String name) {
        this.value = value;
        this.name = name;
    }

    public String getValue() {
        return value;
    }

    public String getName() {
        return name;
    }
}
